Revit 2027 API
ColorWithTransparency Methods
The ColorWithTransparency type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBlue |  get blue
GetColor |  get color
GetGreen |  get green
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRed |  get red
GetTransparency |  get transparency
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetBlue |  set blue
SetColor |  set color
SetGreen |  set green
SetRed |  set red
SetTransparency |  set transparency
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace